blog-posts/2011-09-13-deliberate-practice-typing-faster-and-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Deliberate practice, typing faster, and Emacs</title>
<!-- 2015-10-19 Mon 14:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Deliberate practice, typing faster, and Emacs</h1>
<p>
September 13th, 2011 -
<a href="http://sachachua.com/blog/p/22486"><a href="http://sachachua.com/blog/p/22486">http://sachachua.com/blog/p/22486</a></a>
</p>

<p>
I type at about 90-95 wpm. I wonder: Would it be worth getting even
faster? How would I go about doing it without increasing my risks of
RSI? I'm thinking about this because of something I read in
<a href="http://books.google.ca/books?id=-Ac81W-ZQDEC&dq=moonwalking+with+einstein&hl=en&ei=OK1qTuLyCuPo0QHXvJCHBQ&sa=X&oi=book_result&ct=result&resnum=1&ved=0CC4Q6AEwAA">Moonwalking
with Einstein: The Art and Science of Remembering Everything</a>. On page
172, Joshua Foer writes this about deliberate practice:
</p>

<blockquote>
<p>
The secret to improving at a skill is to retain some degree of
 conscious control over it while practicing&#x2013;to force oneself to stay
 out of autopilot. With typing, it's relatively easy to get past the
OK
 plateau. Psychologists have discovered that the most efficient method
 is to force yourself to type faster than feels comfortable, and to
 allow yourself to make mistakes. In one noted experiment, typists
were
 repeatedly flashed words 10 to 15 percent faster than their fingers
 were able to translate them onto the keyboard. At first they were'nt
 able to keep up, but over a period of days they figured out the
 obstacles that were slowing them down, and overcame them, and then
 continued to type at the faster speed. By bringing typing out of the
 autonomous stage and back under their conscious control, they had
 conquered the OK plateau.
</p>
</blockquote>

<p>
If I were to invest time into typing better, it would be for these
reasons:
</p>

<ul class="org-ul">
<li>to lower the risk of RSI by making correct movements, like the way
shifting to Dvorak helped me tweak my brain to type more effectively
(I type at about the same rate on QWERTY and Dvorak, but Dvorak feels
better)
</li>
<li>to reduce the friction between thought and writing even more
</li>
<li>to transcribe things more efficiently
</li>
<li>to explore just how fast I can go
</li>
</ul>

<p>
My brain's more of a bottleneck than my fingers are, so typing isn't
getting in the way of much. It's still something to be curious about,
though!
</p>

<p>
<a href="http://stenoknight.com/plover/">The open-source Plover stenography
program</a> looks really interesting. I'm going to be on a
Windows-host-Linux-VM system for a while, so I'll need to wait for the
Windows port (or shift back to Linux as my host OS).
</p>

<p>
Most typing tutors / speed measurements I've come across aren't quite
what I'm looking for because they display lots of text and scroll
through it, which is good for buffering things in your head and not so
good for training past the point of failure. Typing games tend to kill
you once you miss too many words.
</p>

<p>
Enter Emacs. Among many many things, Emacs has at least one typing game.
It's not built in, but you can get it from the Emacs Wiki:
<a href="http://www.emacswiki.org/emacs/TypingOfEmacs">The Typing of Emacs</a>. A
few quick modifications later (which I'll post next week if I get
permission), and I've:
</p>

<ul class="org-ul">
<li>added a “zombie mode” that will keep the game going even after you
hit your threshold of failure
</li>
<li>added the question-and-answer mode that the code hinted at
</li>
</ul>

<p>
Zombie-mode Typing of Emacs lets me stay in the “this is going way too
fast for me” zone, sometimes repeating a single word until I've gotten
the hang of it or I've given up. For example, I haven't figured out how
to type CreativeCommons in 2 seconds. The closest I got in 10 tries was
the one time I typed “CreativeComomns”, which was sooo close. Usually,
the timeout kicked in on the last few characters.
</p>

<p>
Maybe it's because I also have to hit Enter to submit what I've typed.
Hmm, I wonder if I can redefine some keys&#x2026;
</p>

<p>
Successfully typing CreativeCommons in 2 seconds still gets me around
95wpm, though, and reading + typing + pressing Enter makes it difficult
to get down to 1-second time limits (darn those reaction times!). Maybe
I'll use my new Q&amp;A support to play around with typing sentences.
</p>

<p>
If I spend more time typing in autocorrecting environments or shifting
to editing after typing (it's good to review anyway), then I might be
able to loosen up enough to type faster. =)
</p>

<p>
There are plenty of sites and apps to help people get from 30wpm to
60wpm or whatever, but not really YouTube videos have mostly people
banging away on keyboards. Are you the fastest typist among your
friends? Have you worked on getting even faster? Do share!
</p>

<p>
2011-09-09 Fri 20:08
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
